package Java_Homeworks.Seminar05;

public class Homework {
   public static void main(String[] args) {
        /*1.Реализуйте структуру телефонной книги с помощью HashMap, учитывая, что 1 человек может иметь несколько телефонов.*/

        /*2.Пусть дан список сотрудников: Иван (и остальные, полный текст дз будет на платформе)
        Написать программу, которая найдет и выведет повторяющиеся имена с количеством повторений. Отсортировать по убыванию популярности.*/

        /* 3.Реализовать алгоритм пирамидальной сортировки (HeapSort).*/
        
        /* 4.На шахматной доске расставить 8 ферзей так, чтобы они не били друг друга. */
   } 
}
